-module(data_system).

-compile(export_all).



%% 
%% 购买培养卡的金币
get(1) -> 16;

%% 世界boss每个等级虚拟房间个数
get(2) -> 5;

%% 坐骑喂养次数
get(3) -> 20;

%% 购买天赋卡的金币
get(4) -> 18;

%% 天赋提升保护消耗的金币
get(5) -> 15;

%% 刷新种子品质消耗的金币
get(6) -> 5;

%% 肥沃土地的收益系数
get(7) -> 1.2;

%% 奴隶系统开启的等级限制
get(8) -> 30;

%% 角色生成时候送的绑定元宝
get(9) -> 0;

%% 角色生成时候送的非绑定元宝
get(10) -> 0;

%% 角色生成时候送的银币
get(11) -> 0;

%% 等级
get(12) -> {1,100};

%% 打坐活动飞鞋传送坐标，随机传送至其中一个
get(13) -> [{91,74},{104,73},{120,72},{120,80},{241,61},{226,67},{250,59},{99,123},{121,124},{112,133}];

%% 刷新军功任务每次消耗的元宝
get(14) -> 3;

%% 立即完成每个军功任务消耗的元宝
get(15) -> 3;

%% 魂珠系统中,自动购买魂石的时候每个魂石消耗的元宝
get(16) -> 12;

%% 爬塔扫荡功能，每关扫荡花费的银币
get(17) -> 1000;

%% 君威玩法中压中兴奋美女增加的君威
get(18) -> 10;

%% 君威玩法中没有压中兴奋美女增加的君威
get(19) -> 0;

%% 君威玩法中压中一般美女增加的君威
get(20) -> 3;

%% 君威玩法中没有压中一般美女增加的君威
get(21) -> 1;

%% 每一个军令所需要的金元宝
get(22) -> 10;

%% 天灵神剑开启时间
get(23) -> [{11,40,0},{13,40,0},{15,40,0},{17,40,0}];

%% 天灵神剑持续时间
get(24) -> 900;

%% 第一次跑商触发战斗
get(25) -> {122,{1000,203,133},401};

%% 1~30级别玩家每天送的元宝，0为不送
get(26) -> 0;

%% 31~50级别玩家每天送的元宝，0为不送
get(27) -> 0;

%% 50级别以上玩家每天送的元宝，0为不送
get(28) -> 0;

%% 送元宝的邮件标题，注意不要缺少双引号
get(29) -> "欢迎今天回到三国世界";

%% 送元宝的邮件内容，注意不要缺少双引号
get(30) -> "请查收今天奉上的礼金";

%% 天灵神剑活动随机事件频率
get(31) -> 100;

%% 天灵神剑活动随机事件奖品
get(32) -> [{445,1,50},{451,1,40},{452,1,10}];

%% 在原野村虚拟房间中的最大人数
get(33) -> 500;

%% 原野村虚拟房间的个数
get(34) -> 5;

%% 新手运镖的特殊处理
get(35) -> 122;

%% 与野外怪战斗超过次数次，超过则无法获得经验奖励。
get(36) -> 800;

%% 群魔乱舞守卫成功礼包
get(37) -> 493;

%% 首次加入公会礼包
get(38) -> [{silver,200000},{bind_gold,0}];

%% 收藏游戏礼包
get(39) -> [{silver,200000},{bind_gold,0}];

%% 首冲大礼包
get(40) -> 1;

%% 升级时不需要降一级强化等级的装备的穿戴等级
get(41) -> [1,10,20];

%% 群魔乱舞战斗力加成的系数
get(42) -> 300000;

%% 绑定手机礼包
get(43) -> 498;

%% 野外怪移动频率，单位秒
get(44) -> 6;

%% 世界boss随机掉落藏宝图的概率
get(45) -> [{433,1,10}];

%% 商城抢购物品刷新间隔（单位小时）
get(46) -> 6;

%% 君威玩法中兴奋状态出现的概率，最高100（即必现）
get(47) -> 40;

%% 群魔乱舞排名奖励经验下限
get(48) -> 30000;

%% 铜币副本等级加成比例系数
get(49) -> 0.18;

%% 比武活动开始报名的时间，{时,分,秒}
get(50) -> {19,30,0};

%% 比武活动正式开始的时间，{时,分,秒}
get(51) -> {19,33,0};

%% 比武活动结束的时间，{时,分,秒}
get(52) -> {20,0,10};

%% 群魔乱舞最小参加人数
get(53) -> 1;

%% 群魔乱舞最大参加人数
get(54) -> 250;

%% 群魔乱舞默认参加人数
get(55) -> 210;

%% 61级别玩家每天送的元宝，0为不送
get(56) -> 0;

%% 悬赏任务刷新金币
get(57) -> 5;

%% 悬赏任务自动完成金币
get(58) -> 5;

%% 我是老玩家的奖励
get(59) -> [];

%% 我是老玩家的邮件标题
get(60) -> "老玩家特权奖励";

%% 我是老玩家邮件内容
get(61) -> "老玩家回归，大礼送上！请查收礼金:1000金元宝，200W铜币.";

%% 群魔乱舞报名时间
get(62) -> {20,58,0};

%% 群魔乱舞开始时间
get(63) -> {21,00,0};

%% 群魔乱舞持续秒数
get(64) -> 1800;

%% 装备锻造涉及到的材料
get(65) -> [445,272,273,274,275,276,277,278,279,280,281,282,494,495,496,497,406,407,408,409,410,411,412];

%% 智慧答题准备时间：秒
get(66) -> 20;

%% 智慧答题读题时间：秒
get(67) -> 10;

%% 智慧答题作答时间：秒
get(68) -> 10;

%% 智慧答题公布答案时间：秒
get(69) -> 5;

%% 智慧答题结束缓冲时间：秒
get(70) -> 20;

%% 测试期间每天帮派允许加人的数量上限，分别为1-10级帮
get(71) -> {45,50,55,60,65,70,75,80,85,90,95,100,105,110,115,120,125,130,135,140};

%% 测试期间每人每天给帮派捐献的金元宝上限
get(72) -> 1000;

%% 智慧答题开启时间
get(73) -> [{12,15,0},{18,15,0}];

%% 智慧答题题目数
get(74) -> 30;

%% 1全服显示送花,0不显示
get(75) -> 1;

%% 战斗力颜色
get(76) -> [0,15000,35000,80000,150000];

%% 领地战的开启日(就是星期几开)
get(77) -> [1,2,3,4,5,6,7];

%% 领地战拆塔分
get(78) -> 3;

%% 领地战战斗胜利分
get(79) -> 15;

%% 领地战战斗失败分
get(80) -> 10;

%% 领地战道具刷新秒
get(81) -> 120;

%% 每秒钟显示的广播最大条数
get(82) -> 2;

%% 开服活动的特殊武将--孙尚香、大乔
get(83) -> [25,26];

%% 第一次进去播剧情的地图
get(84) -> [3600];

%% 开服活动开/关，现在是开(1开2关)
get(85) -> 1;

%% 群魔乱舞的开启日(就是星期几开)
get(86) -> [1,2,3,4,5,6,7];

%% 最低世界聊天等级
get(87) -> 15;

%% 背包格子默认开启个数
get(89) -> 48;

%% 仓库格子默认开启个数
get(90) -> 30;

%% 每天跨服pk战斗的次数
get(91) -> 10;

%% 跨服pk开始时间
get(92) -> [{12,30,0},{19,0,0}];

%% 跨服pk持续时间（秒）
get(93) -> 1800;

%% 参加跨服pk需要的等级
get(94) -> 50;

%% 参加跨服pk需要的战斗力
get(95) -> 12000;

%% 跨服pk刷新邀请列表的cd时间（秒）
get(96) -> 30;

%% 领地战拆塔初始读条时间(千分之一秒)
get(97) -> 5000;

%% 领地战每次成功拆塔后增加的读条时间
get(98) -> 3000;

%% 领地战拆塔初始CD时间
get(99) -> 5000;

%% 领地战每次成功拆塔后增加的CD时间
get(100) -> 6000;

%% 领地战打败上次第一名公会成员加的额外分数
get(101) -> 5;

%% 跨服pvp组队匹配时间
get(102) -> [10,10,40];

%% 跨服pvp天梯匹配时间
get(103) -> [20,20,20,60];

%% 跨服pvp组队匹配范围
get(104) -> [0.1,0.2,0.3];

%% 跨服pvp天梯匹配范围
get(105) -> [100,250,400,1500];

%% 军功种子开启的封地等级
get(106) -> 3;

%% 普通副本总次限
get(107) -> 8;

%% 精英副本总次数
get(108) -> 4;

%% 新服避免天灵神剑跨服天数
get(109) -> 3;

%% 首席弟子奖励
get(110) -> [{silver,200000}];

%% 装备强化公告等级
get(111) -> [10,13,15,18,20,23,25,26,27,28,29,30];

%% 装备改良公告星级
get(112) -> [5,8,10,12,14,15,16,17,18,19,20];

%% 铜币副本组队，等级加成系数
get(113) -> 0.2;

%% 领地战报名时间
get(114) -> {20,00,0};

%% 领地战开始时间
get(115) -> {20,02,0};

%% 领地战结束时间
get(116) -> {20,30,0};

%% 抢夺军粮的比例，抢夺次数上限，被抢次数上限
get(117) -> {0.05,3,2};

%% 竞技场购买次数费用上限
get(118) -> 50;

%% 天灵神剑的缓冲时间
get(119) -> 7;

%% 紫装怒气
get(120) -> 25;

%% 橙装怒气
get(121) -> 40;

%% 战斗公式减伤的系数
get(122) -> 200;

%% 八阵图开启时间
get(123) -> {21,30,0};

%% 八阵图参加等级
get(124) -> 40;

%% 八阵图参加战斗力
get(125) -> 5000;

%% 虎卫每回合自动恢复的怒气
get(126) -> 10;

%% 猛将每次暴击恢复的怒气
get(127) -> 5;

%% 军师每次命中恢复的怒气
get(128) -> 3;

%% 佣兵每回合自动恢复的怒气
get(129) -> 15;

%% 怪物每回合自动恢复的怒气
get(130) -> 20;

%% 神秘商店元宝刷新积分
get(131) -> 5;

%% 红装怒气
get(132) -> 50;

%% 砸金狮活动幸运提升成功率
get(133) -> 0.4;

%% 红装的套装怒气恢复
get(134) -> 10.


%%================================================
